# Ml Pipeline 11-sep-2024

In [2]:
# IBM interview question
# ques) use list or list comprehension to solve the word is palindrome or not.
 
# a = input("enter the word")
# a
# b = list(a)
# b.reverse()
# d=''.join(b)
# d
# if a == d:
#     print("palindrome")
# else:
#     print("Not palindrome")

# Advance ML -> 3rd session 16 sep 2024.

In [4]:
# code 1
#<--------->
import pandas as pd
import numpy as np

In [5]:
# code 2.1) creating a df
#<----------------------->

data = {
    'country' : ['USA','INDIA','UK',np.nan],
    'comment' : ['OK','*','?','#'],
    'GDP' : [21.4,1.74,2.78,np.nan],
    'year' : [2021,2021,2020,2019],
    'capital' : ['Washington','New Delhi','London',np.nan]
}

In [6]:
# code 2.2

df = pd.DataFrame(data)
df

  country comment    GDP  year     capital
0     USA      OK  21.40  2021  Washington
1   INDIA       *   1.74  2021   New Delhi
2      UK       ?   2.78  2020      London
3     NaN       #    NaN  2019         NaN

In [7]:
# code 3.1 -> checking null values
#<---------------------------------->
# isnull() return the df in a boolean form.
df.isnull()

   country  comment    GDP   year  capital
0    False    False  False  False    False
1    False    False  False  False    False
2    False    False  False  False    False
3     True    False   True  False     True

In [8]:
# code 3.2
a = df.isnull().axis=1
a

1

In [9]:
# code 3.3
df.loc[a]

country        INDIA
comment            *
GDP             1.74
year            2021
capital    New Delhi
Name: 1, dtype: object

In [10]:
# code 3.4
df.isnull().sum()

country    1
comment    0
GDP        1
year       0
capital    1
dtype: int64

In [11]:
# code 4) creating a new dataframe -> fd
#<---------------------------------------->
fd = pd.DataFrame(data)

# there are two way to fill nan

In [12]:
# fill all Nan
#<--------------->
# fd.fillna('mean') # 1 method

In [13]:
# Fill Particular column nan
#<---------------------------->
# fd['GDP'].fillna('mean')

In [14]:
# code 5.1) fill particular column with mean
#<------------------------------------>
fd['GDP'].fillna(fd['GDP'].mean(),inplace=True) # 2nd method (recommended)

# here we are filling 1st nan

C:\Users\Acer\AppData\Local\Temp\ipykernel_1820\1906321796.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  fd['GDP'].fillna(fd['GDP'].mean(),inplace=True) # 2nd method (recommended)

In [15]:
fd

# analysis now the gdp nan value fill with the mean of this column.

  country comment    GDP  year     capital
0     USA      OK  21.40  2021  Washington
1   INDIA       *   1.74  2021   New Delhi
2      UK       ?   2.78  2020      London
3     NaN       #   8.64  2019         NaN

In [16]:
# median of GDP column
#<---------------------->
fd['GDP'].median()

5.709999999999999

In [17]:
# forward filling also called locf-> last observation carry forward


# fd['GDP'].fillna('mean') # 1
# fd['Country'].fillna(method = 'ffill',inplace=True)

In [18]:
# code 5.2
#<----------->
fd['country'].fillna(method = 'ffill',inplace =True)
fd

# 2nd nan

C:\Users\Acer\AppData\Local\Temp\ipykernel_1820\875359584.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  fd['country'].fillna(method = 'ffill',inplace =True)
C:\Users\Acer\AppData\Local\Temp\ipykernel_1820\875359584.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  fd['country'].fillna(method = 'ffill',inplace =True)

  country comment    GDP  year     capital
0     USA      OK  21.40  2021  Washington
1   INDIA       *   1.74  2021   New Delhi
2      UK       ?   2.78  2020      London
3      UK       #   8.64  2019         NaN

In [19]:
# bfilll -> niche wale ko upar lana hai to.
            # means fill with just below value
#<------------------------------------------------>

In [20]:
# code 5.3
fd['capital'].fillna(method = 'ffill',inplace =True)
fd

# 3rd nan

C:\Users\Acer\AppData\Local\Temp\ipykernel_1820\3828666404.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  fd['capital'].fillna(method = 'ffill',inplace =True)
C:\Users\Acer\AppData\Local\Temp\ipykernel_1820\3828666404.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  fd['capital'].fillna(method = 'ffill',inplace =True)

  country comment    GDP  year     capital
0     USA      OK  21.40  2021  Washington
1   INDIA       *   1.74  2021   New Delhi
2      UK       ?   2.78  2020      London
3      UK       #   8.64  2019      London

In [21]:
# code 6.1) printing the row match with the symbols list
#<-------------------------------------------------------->

fd1 = pd.DataFrame(data).values
symbols = ["*","#","?"]
for row in fd1:
    if set(row) & set(symbols):
        print(row)

['INDIA' '*' 1.74 2021 'New Delhi']
['UK' '?' 2.78 2020 'London']
[nan '#' nan 2019 nan]

In [22]:
fd

  country comment    GDP  year     capital
0     USA      OK  21.40  2021  Washington
1   INDIA       *   1.74  2021   New Delhi
2      UK       ?   2.78  2020      London
3      UK       #   8.64  2019      London

In [23]:
# code 6.2 mycode
# checking all columns for symbols
#<----------------------------------->

# for symbol in symbols:
#     filtered_rows = df[df['comment'] == symbol]
#     print(f"Rows with symbol '{symbol}':")
#     print(filtered_rows)
#     print()

In [24]:
# code 6.3 mycode -> checking particular column for symbols
# symbols = ['*', '?', '#']

# # Filter and print rows with the symbols
# for symbol in symbols:
#     print(fd[fd['comment'] == symbol])
#     print()

In [25]:
# Code 7) This is only view not change in existing dataframe
#<-------------------------------------------------------------->
# fd['comment'].replace({'*': 'Not OK', '?': 'OK', '#': 'Not OK'})

In [26]:
# fd

In [27]:
# code 8) # change in original df
#<------------------------------------>
# fd['comment'] = fd['comment'].replace({'*': 'Not OK', '?': 'OK', '#': 'Not OK'})
# fd

# practice code

In [29]:
# printing puctuations
import string
print(string.punctuation)

!"#$%&'()*+,-./:;<=>?@[\]^_`{|}~

In [30]:
print(list(string.punctuation))

['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`', '{', '|', '}', '~']

In [31]:
# how to convert into list
#<---------------------------->
a = "hello"
b = list(a)
print(type(b))

<class 'list'>

In [32]:
df1 = pd.DataFrame(data)

In [33]:
a = list(string.punctuation)

In [34]:
len(df1)

4

In [35]:
# using lambda
import pandas as pd
import string
a = list(string.punctuation)
df9['comment'] = df9['comment'].apply(lambda x: 'OK' if x in a else x)
print(df9)

NameError: name 'df9' is not defined

In [ ]:
# fill symbols with ok and not ok
#<---------------------------------->

import pandas as pd
import string
import numpy as np

# Sample data
data = {
    'country': ['USA', 'INDIA', 'UK', 'UK'],
    'comment': ['OK', '*', '?', '#'],
    'GDP': [21.40, 1.74, 2.78, 8.64],
    'year': [2021, 2021, 2020, 2019],
    'capital': ['Washington', 'New Delhi', 'London', 'London']
}

df10 = pd.DataFrame(data)

# List of punctuation symbols
symbols = list(string.punctuation)

# Identify rows where 'comment' is a symbol
symbol_rows = df10[df10['comment'].isin(symbols)].index.tolist()

# Check if there are symbols to replace
if len(symbol_rows) > 0:
    # Shuffle the indices randomly
    np.random.shuffle(symbol_rows)
    
    # Calculate the split point
    half = len(symbol_rows) // 2

    # Assign 'OK' to the first half and 'Not OK' to the second half
    df10.loc[symbol_rows[:half], 'comment'] = 'OK'
    df10.loc[symbol_rows[half:], 'comment'] = 'Not OK'

# Display the updated DataFrame
print(df10)

# 17 sep 2024

In [ ]:
df1 = pd.DataFrame(fd)
df1

In [ ]:
df1.replace({'*':np.nan,
           '?':np.nan,
           '#':np.nan},
          inplace=True)
df1

In [ ]:
df.isnull().sum()

In [ ]:
# if between 20 to 30 percent null values then remove it.

In [ ]:
df1.drop('comment',axis=1, inplace=True)

In [ ]:
df1

In [ ]:
# types of missing data
# #<--------------------->
# MCAR -> missing completely at random
# MAR -> missing at random
# MNAR -> missing not at random

In [ ]:
# Howework 
# read train dataset and drop cabin column

In [ ]:
import pandas as pd
df2 = pd.read_csv(r"C:\Users\Acer\Downloads\train.csv")
df2

In [ ]:
df2.drop('Cabin',axis=1, inplace=True)

# bcoz 30% null data

In [ ]:
df2

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
# encoding Embarked column
#<------------------------->
le = LabelEncoder()
le.fit_transform(df2["Embarked"])

In [ ]:
df2["en_Embarked"] = le.fit_transform(df2["Embarked"])

In [ ]:
# encoding sex column
le.fit_transform(df2["Sex"])

In [ ]:
df2["en_Sex"] = le.fit_transform(df2["Sex"])

In [ ]:
df2

In [ ]:
# dropping Embarked
a = df2.drop("Embarked",axis=1,inplace=True)

In [ ]:
# dropping Sex
df2.drop("Sex",axis=1,inplace=True)

In [ ]:
df2

In [ ]:
df2["Age"].isnull().sum()